### Planned Changes to Server Infrastructure
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`
#### Terraform Validation 🤖 `success`

<details><summary>Show Plan</summary>

```terraform
random_string.resource_code: Refreshing state... [id=7o8xwaka]
module.server.random_password.password: Refreshing state... [id=none]
module.server.random_password.session_secret_value: Refreshing state... [id=none]
github_repository_environment.this: Refreshing state... [id=indok-api:production]
data.azurerm_client_config.current: Reading...
module.server.data.azurerm_key_vault_secret.feide_client_secret: Reading...
module.server.module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka]
module.server.data.azurerm_client_config.current: Reading...
module.server.data.azurerm_key_vault_secret.postmark_api_token: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00MmJiMGZiYS0wZmIyLTRjZWItYmRiZi1jNmNjNmFmZTI1MDY7b2JqZWN0SWQ9Y2IxNTc2YmItMjYxOC00NWEwLTgzNjMtMDU3NWQ3ZTdlNDEyO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]
module.server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00MmJiMGZiYS0wZmIyLTRjZWItYmRiZi1jNmNjNmFmZTI1MDY7b2JqZWN0SWQ9Y2IxNTc2YmItMjYxOC00NWEwLTgzNjMtMDU3NWQ3ZTdlNDEyO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]
module.server.module.managed_identity.azurerm_user_assigned_identity.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.ManagedIdentity/userAssignedIdentities/managed-identity-7o8xwaka]
module.server.module.vnet.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/virtualNetworks/vnet-7o8xwaka]
module.server.module.container_app_environment.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.OperationalInsights/workspaces/ca-log-workspace-7o8xwaka]
module.server.module.redis.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net]
module.server.module.database.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/privateDnsZones/production-7o8xwaka.postgres.database.azure.com]
module.server.module.redis.azurerm_redis_cache.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Cache/redis/redis7o8xwaka]
module.server.module.redis.azurerm_subnet.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/virtualNetworks/vnet-7o8xwaka/subnets/redis-subnet-7o8xwaka]
module.server.module.container_app_environment.azurerm_subnet.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/virtualNetworks/vnet-7o8xwaka/subnets/ca-subnet-7o8xwaka]
module.server.module.database.azurerm_subnet.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/virtualNetworks/vnet-7o8xwaka/subnets/pg-subnet-7o8xwaka]
module.server.azurerm_role_assignment.key_vault_user: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Authorization/roleAssignments/3f3dc4d0-bea7-e10e-7ed4-2495fd459a06]
module.server.azurerm_role_assignment.rg_reader: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Authorization/roleAssignments/dfd26610-34ca-2698-65fb-50110851658a]
module.server.module.key_vault.azurerm_key_vault.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.KeyVault/vaults/key-vault-7o8xwaka]
module.server.module.blob_storage.azurerm_storage_account.main: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Storage/storageAccounts/appstore7o8xwaka]
module.server.module.redis.azurerm_private_dns_zone_virtual_network_link.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net/virtualNetworkLinks/vnet-private-zone-link]
module.server.module.database.azurerm_private_dns_zone_virtual_network_link.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/privateDnsZones/production-7o8xwaka.postgres.database.azure.com/virtualNetworkLinks/pg-7o8xwaka.com]
module.server.module.database.azurerm_postgresql_flexible_server.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.DBforPostgreSQL/flexibleServers/pg-fs-7o8xwaka]
module.server.module.container_app_environment.azurerm_container_app_environment.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.App/managedEnvironments/ca-env-7o8xwaka]
module.server.data.azurerm_key_vault_secret.postmark_api_token: Read complete after 2s [id=https://shared-key-vault-altht.vault.azure.net/secrets/postmark-api-token/fb5215c57cd64a349554c5830934b085]
module.server.data.azurerm_key_vault_secret.feide_client_secret: Read complete after 2s [id=https://shared-key-vault-altht.vault.azure.net/secrets/feide-client-secret/299f08ebe57941dda63f30a792037af0]
module.server.module.database.azurerm_postgresql_flexible_server_database.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.DBforPostgreSQL/flexibleServers/pg-fs-7o8xwaka/databases/pg-fs-db-7o8xwaka]
module.server.azurerm_key_vault_secret.session_secret: Refreshing state... [id=https://key-vault-7o8xwaka.vault.azure.net/secrets/session-secret/d25064f2b362478e82fbadf42021336c]
module.server.azurerm_key_vault_secret.db_connection_string: Refreshing state... [id=https://key-vault-7o8xwaka.vault.azure.net/secrets/db-connection-string/722a31c6866e4ee5ba94f11514653007]
module.server.azurerm_key_vault_secret.redis_connection_string: Refreshing state... [id=https://key-vault-7o8xwaka.vault.azure.net/secrets/redis-connection-string/299b4c157e03410794728208e582ae51]
module.server.module.redis.azurerm_private_endpoint.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Network/privateEndpoints/endpoint-7o8xwaka]
module.server.module.blob_storage.azurerm_storage_container.main: Refreshing state... [id=https://appstore7o8xwaka.blob.core.windows.net/appstore7o8xwakacontainer]
module.server.azurerm_container_app.worker: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.App/containerApps/worker-7o8xwaka]
module.server.azurerm_container_app.server: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.App/containerApps/server-7o8xwaka]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.server.azurerm_container_app.server will be updated in-place
  ~ resource "azurerm_container_app" "server" {
        id                            = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.App/containerApps/server-7o8xwaka"
        name                          = "server-7o8xwaka"
        tags                          = {
            "environment" = "production"
            "workspace"   = "default"
        }
        # (8 unchanged attributes hidden)

      ~ template {
            # (2 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/rubberdok/server:4b8d4c2def8b683bb4f8adb8d4ec5c6141e92bfd" -> "ghcr.io/rubberdok/server:latest"
                name              = "server"
                # (5 unchanged attributes hidden)

              ~ env {
                    name  = "SENTRY_RELEASE"
                  ~ value = "4b8d4c2def8b683bb4f8adb8d4ec5c6141e92bfd" -> "7441bf2ecb915a4648506027dc7510d4efa31036"
                }

                # (29 unchanged blocks hidden)
            }

          ~ init_container {
              ~ image             = "ghcr.io/rubberdok/server:4b8d4c2def8b683bb4f8adb8d4ec5c6141e92bfd" -> "ghcr.io/rubberdok/server:latest"
                name              = "migrate"
                # (5 unchanged attributes hidden)

              ~ env {
                    name  = "SENTRY_RELEASE"
                  ~ value = "4b8d4c2def8b683bb4f8adb8d4ec5c6141e92bfd" -> "7441bf2ecb915a4648506027dc7510d4efa31036"
                }

                # (26 unchanged blocks hidden)
            }
        }

        # (9 unchanged blocks hidden)
    }

  # module.server.azurerm_container_app.worker will be updated in-place
  ~ resource "azurerm_container_app" "worker" {
        id                            = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.App/containerApps/worker-7o8xwaka"
        name                          = "worker-7o8xwaka"
        tags                          = {
            "environment" = "production"
            "workspace"   = "default"
        }
        # (7 unchanged attributes hidden)

      ~ template {
            # (2 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/rubberdok/server:4b8d4c2def8b683bb4f8adb8d4ec5c6141e92bfd" -> "ghcr.io/rubberdok/server:latest"
                name              = "worker"
                # (5 unchanged attributes hidden)

              ~ env {
                    name  = "SENTRY_RELEASE"
                  ~ value = "4b8d4c2def8b683bb4f8adb8d4ec5c6141e92bfd" -> "7441bf2ecb915a4648506027dc7510d4efa31036"
                }

                # (26 unchanged blocks hidden)
            }
        }

        # (8 unchanged blocks hidden)
    }

  # module.server.azurerm_role_assignment.blob_storage_contributor will be created
  + resource "azurerm_role_assignment" "blob_storage_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "731be633-0b89-4406-9fd0-6f99ee741944"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-7o8xwaka/providers/Microsoft.Storage/storageAccounts/appstore7o8xwaka"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @larwaa, Action: `pull_request`*